; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=330, out_folder=./training, instance_id=21, seed=2045, goal_proportion=0.03

(define (problem blocksworld-21)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 - object)
 (:init 
    (arm-empty)
    (clear b269)
    (on b269 b65)
    (on b65 b286)
    (on-table b286)
    (clear b42)
    (on b42 b139)
    (on-table b139)
    (clear b298)
    (on b298 b133)
    (on b133 b171)
    (on b171 b300)
    (on b300 b10)
    (on b10 b291)
    (on b291 b200)
    (on b200 b195)
    (on b195 b54)
    (on b54 b229)
    (on b229 b173)
    (on-table b173)
    (clear b183)
    (on b183 b191)
    (on b191 b165)
    (on b165 b12)
    (on b12 b202)
    (on b202 b2)
    (on b2 b38)
    (on-table b38)
    (clear b7)
    (on b7 b145)
    (on-table b145)
    (clear b307)
    (on b307 b283)
    (on b283 b79)
    (on b79 b295)
    (on b295 b255)
    (on b255 b273)
    (on-table b273)
    (clear b227)
    (on-table b227)
    (clear b326)
    (on b326 b113)
    (on b113 b256)
    (on b256 b170)
    (on b170 b238)
    (on-table b238)
    (clear b188)
    (on b188 b309)
    (on b309 b325)
    (on-table b325)
    (clear b61)
    (on b61 b6)
    (on b6 b321)
    (on b321 b22)
    (on b22 b33)
    (on b33 b257)
    (on b257 b18)
    (on b18 b190)
    (on b190 b82)
    (on b82 b288)
    (on b288 b25)
    (on b25 b261)
    (on b261 b9)
    (on-table b9)
    (clear b110)
    (on b110 b197)
    (on-table b197)
    (clear b330)
    (on-table b330)
    (clear b151)
    (on b151 b88)
    (on b88 b14)
    (on-table b14)
    (clear b270)
    (on-table b270)
    (clear b169)
    (on b169 b123)
    (on b123 b72)
    (on b72 b217)
    (on b217 b119)
    (on b119 b63)
    (on-table b63)
    (clear b154)
    (on b154 b28)
    (on b28 b93)
    (on-table b93)
    (clear b99)
    (on-table b99)
    (clear b35)
    (on b35 b175)
    (on-table b175)
    (clear b293)
    (on-table b293)
    (clear b179)
    (on b179 b45)
    (on b45 b253)
    (on-table b253)
    (clear b159)
    (on b159 b49)
    (on b49 b163)
    (on-table b163)
    (clear b263)
    (on b263 b131)
    (on-table b131)
    (clear b90)
    (on b90 b64)
    (on b64 b32)
    (on-table b32)
    (clear b124)
    (on-table b124)
    (clear b234)
    (on b234 b267)
    (on b267 b304)
    (on b304 b81)
    (on b81 b140)
    (on b140 b37)
    (on-table b37)
    (clear b251)
    (on-table b251)
    (clear b136)
    (on-table b136)
    (clear b276)
    (on b276 b221)
    (on-table b221)
    (clear b94)
    (on b94 b91)
    (on b91 b224)
    (on b224 b302)
    (on b302 b315)
    (on b315 b27)
    (on b27 b144)
    (on b144 b301)
    (on b301 b201)
    (on b201 b198)
    (on b198 b205)
    (on b205 b313)
    (on-table b313)
    (clear b86)
    (on-table b86)
    (clear b67)
    (on b67 b30)
    (on-table b30)
    (clear b209)
    (on b209 b216)
    (on b216 b316)
    (on b316 b11)
    (on b11 b327)
    (on b327 b55)
    (on b55 b4)
    (on-table b4)
    (clear b231)
    (on b231 b230)
    (on b230 b274)
    (on b274 b44)
    (on b44 b73)
    (on b73 b181)
    (on b181 b212)
    (on b212 b250)
    (on b250 b152)
    (on-table b152)
    (clear b143)
    (on b143 b180)
    (on b180 b176)
    (on b176 b75)
    (on b75 b248)
    (on-table b248)
    (clear b128)
    (on b128 b157)
    (on-table b157)
    (clear b23)
    (on b23 b40)
    (on-table b40)
    (clear b146)
    (on b146 b328)
    (on b328 b52)
    (on b52 b285)
    (on b285 b53)
    (on b53 b182)
    (on b182 b284)
    (on b284 b71)
    (on b71 b15)
    (on b15 b194)
    (on b194 b297)
    (on b297 b58)
    (on b58 b207)
    (on b207 b120)
    (on b120 b225)
    (on b225 b142)
    (on b142 b311)
    (on b311 b166)
    (on b166 b8)
    (on b8 b20)
    (on-table b20)
    (clear b16)
    (on b16 b193)
    (on b193 b247)
    (on b247 b318)
    (on b318 b19)
    (on b19 b308)
    (on b308 b41)
    (on b41 b141)
    (on b141 b109)
    (on-table b109)
    (clear b323)
    (on b323 b60)
    (on b60 b259)
    (on b259 b294)
    (on b294 b319)
    (on-table b319)
    (clear b262)
    (on b262 b47)
    (on b47 b314)
    (on b314 b76)
    (on b76 b222)
    (on b222 b303)
    (on b303 b107)
    (on b107 b43)
    (on b43 b219)
    (on-table b219)
    (clear b5)
    (on b5 b228)
    (on-table b228)
    (clear b116)
    (on b116 b105)
    (on b105 b178)
    (on-table b178)
    (clear b211)
    (on b211 b260)
    (on b260 b130)
    (on b130 b148)
    (on-table b148)
    (clear b127)
    (on b127 b70)
    (on b70 b126)
    (on b126 b189)
    (on b189 b275)
    (on b275 b310)
    (on b310 b92)
    (on-table b92)
    (clear b271)
    (on b271 b56)
    (on b56 b177)
    (on b177 b258)
    (on b258 b235)
    (on b235 b246)
    (on b246 b306)
    (on b306 b13)
    (on b13 b245)
    (on b245 b102)
    (on b102 b254)
    (on-table b254)
    (clear b213)
    (on-table b213)
    (clear b156)
    (on-table b156)
    (clear b199)
    (on b199 b320)
    (on b320 b239)
    (on b239 b192)
    (on-table b192)
    (clear b87)
    (on b87 b214)
    (on b214 b287)
    (on b287 b289)
    (on b289 b100)
    (on b100 b186)
    (on b186 b168)
    (on-table b168)
    (clear b125)
    (on b125 b233)
    (on b233 b243)
    (on-table b243)
    (clear b83)
    (on-table b83)
    (clear b160)
    (on b160 b1)
    (on-table b1)
    (clear b95)
    (on b95 b51)
    (on-table b51)
    (clear b158)
    (on b158 b172)
    (on-table b172)
    (clear b185)
    (on b185 b236)
    (on b236 b226)
    (on-table b226)
    (clear b174)
    (on b174 b299)
    (on b299 b117)
    (on-table b117)
    (clear b46)
    (on b46 b97)
    (on b97 b329)
    (on b329 b108)
    (on-table b108)
    (clear b96)
    (on b96 b164)
    (on b164 b203)
    (on b203 b281)
    (on b281 b167)
    (on b167 b278)
    (on b278 b48)
    (on b48 b149)
    (on b149 b249)
    (on b249 b101)
    (on b101 b103)
    (on b103 b240)
    (on b240 b78)
    (on b78 b241)
    (on-table b241)
    (clear b305)
    (on b305 b85)
    (on-table b85)
    (clear b89)
    (on b89 b324)
    (on b324 b150)
    (on b150 b39)
    (on b39 b31)
    (on-table b31)
    (clear b36)
    (on b36 b77)
    (on b77 b161)
    (on b161 b57)
    (on b57 b21)
    (on b21 b24)
    (on b24 b74)
    (on b74 b153)
    (on b153 b210)
    (on-table b210)
    (clear b3)
    (on b3 b106)
    (on b106 b272)
    (on b272 b282)
    (on b282 b242)
    (on b242 b137)
    (on b137 b29)
    (on b29 b296)
    (on b296 b138)
    (on b138 b84)
    (on b84 b279)
    (on-table b279)
    (clear b266)
    (on b266 b277)
    (on b277 b114)
    (on-table b114)
    (clear b80)
    (on b80 b220)
    (on b220 b223)
    (on b223 b134)
    (on b134 b69)
    (on b69 b59)
    (on-table b59)
    (clear b237)
    (on b237 b135)
    (on b135 b322)
    (on-table b322)
    (clear b317)
    (on b317 b196)
    (on-table b196)
    (clear b147)
    (on b147 b111)
    (on b111 b232)
    (on b232 b129)
    (on-table b129)
    (clear b132)
    (on b132 b98)
    (on-table b98)
    (clear b292)
    (on-table b292)
    (clear b112)
    (on-table b112)
    (clear b17)
    (on b17 b264)
    (on b264 b115)
    (on b115 b218)
    (on b218 b62)
    (on b62 b187)
    (on b187 b208)
    (on b208 b122)
    (on b122 b206)
    (on b206 b162)
    (on b162 b268)
    (on b268 b312)
    (on b312 b265)
    (on-table b265)
    (clear b34)
    (on-table b34)
    (clear b280)
    (on b280 b184)
    (on b184 b244)
    (on b244 b104)
    (on b104 b252)
    (on-table b252)
    (clear b118)
    (on b118 b68)
    (on b68 b204)
    (on b204 b155)
    (on-table b155)
    (clear b50)
    (on-table b50)
    (clear b121)
    (on b121 b290)
    (on-table b290)
    (clear b26)
    (on b26 b215)
    (on b215 b66)
    (on-table b66))
 (:goal  (and 
    (clear b8)
    (on b8 b5)
    (on b5 b9)
    (on b9 b4)
    (on b4 b2)
    (on b2 b6)
    (on-table b6)
    (clear b1)
    (on b1 b3)
    (on b3 b7)
    (on-table b7))))

; plan
1. (unstack b7 b145)
   deleted: (on b7 b145) (clear b7) (arm-empty)
   added: (holding b7) (clear b145)
   goals met: 0 of 11
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 11
3. (unstack b146 b328)
   deleted: (on b146 b328) (clear b146) (arm-empty)
   added: (holding b146) (clear b328)
   goals met: 1 of 11
4. (putdown b146)
   deleted: (holding b146)
   added: (clear b146) (arm-empty) (on-table b146)
   goals met: 1 of 11
5. (unstack b160 b1)
   deleted: (on b160 b1) (clear b160) (arm-empty)
   added: (holding b160) (clear b1)
   goals met: 2 of 11
6. (putdown b160)
   deleted: (holding b160)
   added: (clear b160) (arm-empty) (on-table b160)
   goals met: 2 of 11
7. (unstack b183 b191)
   deleted: (on b183 b191) (clear b183) (arm-empty)
   added: (holding b183) (clear b191)
   goals met: 2 of 11
8. (putdown b183)
   deleted: (holding b183)
   added: (clear b183) (arm-empty) (on-table b183)
   goals met: 2 of 11
9. (unstack b191 b165)
   deleted: (on b191 b165) (clear b191) (arm-empty)
   added: (holding b191) (clear b165)
   goals met: 2 of 11
10. (putdown b191)
   deleted: (holding b191)
   added: (clear b191) (arm-empty) (on-table b191)
   goals met: 2 of 11
11. (unstack b165 b12)
   deleted: (on b165 b12) (clear b165) (arm-empty)
   added: (holding b165) (clear b12)
   goals met: 2 of 11
12. (putdown b165)
   deleted: (holding b165)
   added: (clear b165) (arm-empty) (on-table b165)
   goals met: 2 of 11
13. (unstack b12 b202)
   deleted: (on b12 b202) (clear b12) (arm-empty)
   added: (holding b12) (clear b202)
   goals met: 2 of 11
14. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 2 of 11
15. (unstack b202 b2)
   deleted: (on b202 b2) (clear b202) (arm-empty)
   added: (holding b202) (clear b2)
   goals met: 2 of 11
16. (putdown b202)
   deleted: (holding b202)
   added: (clear b202) (arm-empty) (on-table b202)
   goals met: 2 of 11
17. (unstack b209 b216)
   deleted: (on b209 b216) (clear b209) (arm-empty)
   added: (holding b209) (clear b216)
   goals met: 2 of 11
18. (putdown b209)
   deleted: (holding b209)
   added: (clear b209) (arm-empty) (on-table b209)
   goals met: 2 of 11
19. (unstack b216 b316)
   deleted: (on b216 b316) (clear b216) (arm-empty)
   added: (holding b216) (clear b316)
   goals met: 2 of 11
20. (putdown b216)
   deleted: (holding b216)
   added: (clear b216) (arm-empty) (on-table b216)
   goals met: 2 of 11
21. (unstack b316 b11)
   deleted: (on b316 b11) (clear b316) (arm-empty)
   added: (holding b316) (clear b11)
   goals met: 2 of 11
22. (putdown b316)
   deleted: (holding b316)
   added: (clear b316) (arm-empty) (on-table b316)
   goals met: 2 of 11
23. (unstack b11 b327)
   deleted: (on b11 b327) (clear b11) (arm-empty)
   added: (holding b11) (clear b327)
   goals met: 2 of 11
24. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 11
25. (unstack b327 b55)
   deleted: (on b327 b55) (clear b327) (arm-empty)
   added: (holding b327) (clear b55)
   goals met: 2 of 11
26. (putdown b327)
   deleted: (holding b327)
   added: (clear b327) (arm-empty) (on-table b327)
   goals met: 2 of 11
27. (unstack b328 b52)
   deleted: (on b328 b52) (clear b328) (arm-empty)
   added: (holding b328) (clear b52)
   goals met: 2 of 11
28. (putdown b328)
   deleted: (holding b328)
   added: (clear b328) (arm-empty) (on-table b328)
   goals met: 2 of 11
29. (unstack b52 b285)
   deleted: (on b52 b285) (clear b52) (arm-empty)
   added: (holding b52) (clear b285)
   goals met: 2 of 11
30. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 2 of 11
31. (unstack b285 b53)
   deleted: (on b285 b53) (clear b285) (arm-empty)
   added: (holding b285) (clear b53)
   goals met: 2 of 11
32. (putdown b285)
   deleted: (holding b285)
   added: (clear b285) (arm-empty) (on-table b285)
   goals met: 2 of 11
33. (unstack b53 b182)
   deleted: (on b53 b182) (clear b53) (arm-empty)
   added: (holding b53) (clear b182)
   goals met: 2 of 11
34. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 2 of 11
35. (unstack b182 b284)
   deleted: (on b182 b284) (clear b182) (arm-empty)
   added: (holding b182) (clear b284)
   goals met: 2 of 11
36. (putdown b182)
   deleted: (holding b182)
   added: (clear b182) (arm-empty) (on-table b182)
   goals met: 2 of 11
37. (unstack b284 b71)
   deleted: (on b284 b71) (clear b284) (arm-empty)
   added: (holding b284) (clear b71)
   goals met: 2 of 11
38. (putdown b284)
   deleted: (holding b284)
   added: (clear b284) (arm-empty) (on-table b284)
   goals met: 2 of 11
39. (unstack b55 b4)
   deleted: (on b55 b4) (clear b55) (arm-empty)
   added: (holding b55) (clear b4)
   goals met: 2 of 11
40. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 2 of 11
41. (unstack b61 b6)
   deleted: (on b61 b6) (clear b61) (arm-empty)
   added: (holding b61) (clear b6)
   goals met: 2 of 11
42. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 2 of 11
43. (unstack b6 b321)
   deleted: (on b6 b321) (clear b6) (arm-empty)
   added: (holding b6) (clear b321)
   goals met: 2 of 11
44. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 3 of 11
45. (unstack b321 b22)
   deleted: (on b321 b22) (clear b321) (arm-empty)
   added: (holding b321) (clear b22)
   goals met: 3 of 11
46. (putdown b321)
   deleted: (holding b321)
   added: (clear b321) (arm-empty) (on-table b321)
   goals met: 3 of 11
47. (unstack b22 b33)
   deleted: (on b22 b33) (clear b22) (arm-empty)
   added: (holding b22) (clear b33)
   goals met: 3 of 11
48. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 3 of 11
49. (unstack b33 b257)
   deleted: (on b33 b257) (clear b33) (arm-empty)
   added: (holding b33) (clear b257)
   goals met: 3 of 11
50. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 3 of 11
51. (unstack b257 b18)
   deleted: (on b257 b18) (clear b257) (arm-empty)
   added: (holding b257) (clear b18)
   goals met: 3 of 11
52. (putdown b257)
   deleted: (holding b257)
   added: (clear b257) (arm-empty) (on-table b257)
   goals met: 3 of 11
53. (unstack b18 b190)
   deleted: (on b18 b190) (clear b18) (arm-empty)
   added: (holding b18) (clear b190)
   goals met: 3 of 11
54. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 3 of 11
55. (unstack b190 b82)
   deleted: (on b190 b82) (clear b190) (arm-empty)
   added: (holding b190) (clear b82)
   goals met: 3 of 11
56. (putdown b190)
   deleted: (holding b190)
   added: (clear b190) (arm-empty) (on-table b190)
   goals met: 3 of 11
57. (unstack b71 b15)
   deleted: (on b71 b15) (clear b71) (arm-empty)
   added: (holding b71) (clear b15)
   goals met: 3 of 11
58. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 3 of 11
59. (unstack b15 b194)
   deleted: (on b15 b194) (clear b15) (arm-empty)
   added: (holding b15) (clear b194)
   goals met: 3 of 11
60. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 3 of 11
61. (unstack b194 b297)
   deleted: (on b194 b297) (clear b194) (arm-empty)
   added: (holding b194) (clear b297)
   goals met: 3 of 11
62. (putdown b194)
   deleted: (holding b194)
   added: (clear b194) (arm-empty) (on-table b194)
   goals met: 3 of 11
63. (unstack b297 b58)
   deleted: (on b297 b58) (clear b297) (arm-empty)
   added: (holding b297) (clear b58)
   goals met: 3 of 11
64. (putdown b297)
   deleted: (holding b297)
   added: (clear b297) (arm-empty) (on-table b297)
   goals met: 3 of 11
65. (unstack b58 b207)
   deleted: (on b58 b207) (clear b58) (arm-empty)
   added: (holding b58) (clear b207)
   goals met: 3 of 11
66. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 3 of 11
67. (unstack b207 b120)
   deleted: (on b207 b120) (clear b207) (arm-empty)
   added: (holding b207) (clear b120)
   goals met: 3 of 11
68. (putdown b207)
   deleted: (holding b207)
   added: (clear b207) (arm-empty) (on-table b207)
   goals met: 3 of 11
69. (unstack b120 b225)
   deleted: (on b120 b225) (clear b120) (arm-empty)
   added: (holding b120) (clear b225)
   goals met: 3 of 11
70. (putdown b120)
   deleted: (holding b120)
   added: (clear b120) (arm-empty) (on-table b120)
   goals met: 3 of 11
71. (unstack b225 b142)
   deleted: (on b225 b142) (clear b225) (arm-empty)
   added: (holding b225) (clear b142)
   goals met: 3 of 11
72. (putdown b225)
   deleted: (holding b225)
   added: (clear b225) (arm-empty) (on-table b225)
   goals met: 3 of 11
73. (unstack b142 b311)
   deleted: (on b142 b311) (clear b142) (arm-empty)
   added: (holding b142) (clear b311)
   goals met: 3 of 11
74. (putdown b142)
   deleted: (holding b142)
   added: (clear b142) (arm-empty) (on-table b142)
   goals met: 3 of 11
75. (unstack b311 b166)
   deleted: (on b311 b166) (clear b311) (arm-empty)
   added: (holding b311) (clear b166)
   goals met: 3 of 11
76. (putdown b311)
   deleted: (holding b311)
   added: (clear b311) (arm-empty) (on-table b311)
   goals met: 3 of 11
77. (unstack b166 b8)
   deleted: (on b166 b8) (clear b166) (arm-empty)
   added: (holding b166) (clear b8)
   goals met: 4 of 11
78. (putdown b166)
   deleted: (holding b166)
   added: (clear b166) (arm-empty) (on-table b166)
   goals met: 4 of 11
79. (unstack b82 b288)
   deleted: (on b82 b288) (clear b82) (arm-empty)
   added: (holding b82) (clear b288)
   goals met: 4 of 11
80. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 4 of 11
81. (unstack b288 b25)
   deleted: (on b288 b25) (clear b288) (arm-empty)
   added: (holding b288) (clear b25)
   goals met: 4 of 11
82. (putdown b288)
   deleted: (holding b288)
   added: (clear b288) (arm-empty) (on-table b288)
   goals met: 4 of 11
83. (unstack b25 b261)
   deleted: (on b25 b261) (clear b25) (arm-empty)
   added: (holding b25) (clear b261)
   goals met: 4 of 11
84. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 4 of 11
85. (unstack b261 b9)
   deleted: (on b261 b9) (clear b261) (arm-empty)
   added: (holding b261) (clear b9)
   goals met: 4 of 11
86. (putdown b261)
   deleted: (holding b261)
   added: (clear b261) (arm-empty) (on-table b261)
   goals met: 4 of 11
87. (unstack b2 b38)
   deleted: (on b2 b38) (clear b2) (arm-empty)
   added: (holding b2) (clear b38)
   goals met: 4 of 11
88. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 5 of 11
89. (unstack b3 b106)
   deleted: (on b3 b106) (clear b3) (arm-empty)
   added: (holding b3) (clear b106)
   goals met: 5 of 11
90. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 6 of 11
91. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 6 of 11
92. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 7 of 11
93. (unstack b5 b228)
   deleted: (on b5 b228) (clear b5) (arm-empty)
   added: (holding b5) (clear b228)
   goals met: 7 of 11
94. (stack b5 b9)
   deleted: (clear b9) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b9)
   goals met: 8 of 11
95. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 7 of 11
96. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 9 of 11
97. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 8 of 11
98. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 8 of 11
99. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 8 of 11
100. (stack b9 b4)
   deleted: (clear b4) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b4)
   goals met: 9 of 11
101. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 9 of 11
102. (stack b5 b9)
   deleted: (clear b9) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b9)
   goals met: 10 of 11
103. (unstack b8 b20)
   deleted: (on b8 b20) (clear b8) (arm-empty)
   added: (holding b8) (clear b20)
   goals met: 9 of 11
104. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 11 of 11
